# Задачата изисква да разберем колко от 100-те лампи ще бъдат включени в края след последователните действия на 100-те приятели.
#
# Първият приятел влиза и включва всички лампи.
#
# Вторият приятел влиза и изключва всички лампи с четен номер (2, 4, 6 и така нататък).
#
# Третият приятел влиза и се заема само с лампите на позиции, които са кратни на
# 3 (3, 6, 9 и така нататък). Той изключва лампите, които са включени и включва тези, които са изключени.
#
# Този процес продължава с всеки следващ приятел. Всеки приятел се грижи за лампите на позиции,
# които са кратни на неговия номер, и променя състоянието им.
#
# За да разберем колко лампи остават включени на края, трябва да намерим броят на
# "идеалните квадрати" в интервала от 1 до 100. "Идеални квадрати" са тези числа, които са квадрати на цели числа.
#
# Такива числа в интервала от 1 до 100 са: 1, 4, 9, 16, 25, 36, 49, 64, 81 и 100 - общо 10 числа.
#
# Следователно, 10 лампи ще бъдат включени в края на задачата.
#
# Ето и Python код, който демонстрира този процес:



# Начално състояние на лампите - всички изключени
lights = [False] * 100

# Цикъл през всеки приятел
for friend in range(1, 101):
    # Променяме състоянието на лампите в зависимост от номера на приятеля
    for i in range(friend - 1, 100, friend):
        lights[i] = not lights[i]

# Броим колко лампи са включени
count = lights.count(True)

print("Брой включени лампи в края:", count)
